Repository: slynobody/Linux-Mediacenter
Catalog: .kodi/addons/slyguy.disney.plus/resources/language/resource.language.*/strings.po
Languages: hu_hu, nl_nl, sv_se, zh_cn

# #30001
source: Email Address
hu_hu: Email cím
nl_nl: E-mailadres
sv_se: E-postadress
zh_cn: 邮箱地址

# #30002
source: Password
hu_hu: Jelszó
nl_nl: Wachtwoord
sv_se: Lösenord
zh_cn: 密码

# #30003
source: API request failed Server Error: {msg}
hu_hu: API kérési hiba Szerver hiba: {msg}
nl_nl: API-verzoek mislukt Serverfout: {msg}
sv_se: API-begäran misslyckades Serverfel: {msg}
zh_cn: 服务器错误: {msg}

# #30004
source: Movies
hu_hu: Filmek
nl_nl: Films
sv_se: Filmer
zh_cn: 电影

# #30005
source: Series
hu_hu: Sorozatok
sv_se: TV-serier
zh_cn: 剧集

# #30006
source: Originals
hu_hu: Saját gyártás
zh_cn: 原创

# #30007
source: Full Details
hu_hu: Részletesen
nl_nl: Alle details
sv_se: Fullständiga detaljer
zh_cn: 详细信息

# #30008
source: Hubs
hu_hu: Hubok
sv_se: Hubbar
zh_cn: 品牌频道

# #30010
source: Suggested
hu_hu: Ajánlott
sv_se: Förslag
zh_cn: 相关推荐

# #30011
source: Featured
hu_hu: Kiemelt
nl_nl: Uitgelicht
sv_se: Utvalda
zh_cn: 精选

# #30012
source: Season {season}
hu_hu: Évad {season}
nl_nl: Seizoen {season}
sv_se: Säsong {season}
zh_cn: 第 {season} 季

# #30013
source: Extras
hu_hu: Extrák
sv_se: Extra
zh_cn: 额外片段

# #32111
source: bookmarks
zh_cn: 收藏夹

# #30014
source: Full support on Kodi {kodi_ver} requires at least Inputstream Adaptive Version {ver_required} You may experience playback issues with your current version.
hu_hu: A Kodi {kodi_ver} teljes támogatásához legalább a {ver_required} Inputstream adaptive verzióra van szükség Lejátszási problémákat tapasztalhat jelenlegi verzióval.
nl_nl: Volledige ondersteuning op Kodi {kodi_ver} vereist minimaal Inputstream Adaptive Version {ver_required} U kunt afspeelproblemen ondervinden met uw huidige versie.
sv_se: Fullt stöd på Kodi {kodi_ver} kräver minst version {ver_required} av Inputstream Adaptive Du kan uppleva uppspelningsproblem med din nuvarande version.
zh_cn: 对 Kodi {kodi_ver} 的全面支持至少需要 Inputstream Adaptive 版本 {ver_required} 你可能在当前版本下遇到播放问题。

# #30015
source: Dolby Vision / 4K
zh_cn: 杜比视界 / 4K

# #30016
source: Disney+ Sync Playback
hu_hu: Disney+ al szinkronizált lejátszás
sv_se: Disney+ Synkronisera uppspelning
zh_cn: Disney+ 同播共享

# #30020
source: Skip Credits
hu_hu: Szereplőlista átugrása
nl_nl: Credits overslaan
sv_se: Hoppa över eftertexterna
zh_cn: 跳过片尾

# #30021
source: Play Next Episode
hu_hu: Következő rész lejátszása
nl_nl: Volgende aflevering afspelen
sv_se: Spela nästa avsnitt
zh_cn: 播放下一集

# #30022
source: Play Next Recommended Movie
hu_hu: Következő ajánlott film lejátszása
nl_nl: Volgende aanbevolen film afspelen
sv_se: Spela nästa rekommenderade film
zh_cn: 播放下一部推荐电影

# #30023
source: Default Ratio
hu_hu: Alap képarány
nl_nl: Standaardverhouding:
sv_se: Standardförhållande
zh_cn: 默认画面比例

# #30024
source: Skip Intros
hu_hu: Bevezető átugrása
nl_nl: Intro's overslaan
sv_se: Hoppa över intros
zh_cn: 跳过片头

# #30025
source: Play from Start
hu_hu: Lejátszás az elejétől
nl_nl: Afspelen vanaf Start
sv_se: Spela från början
zh_cn: 从头播放

# #30026
source: Watchlist
hu_hu: Saját lista
nl_nl: Kijklijst
sv_se: Min lista
zh_cn: 观看列表

# #30027
source: Add to Watchlist
hu_hu: Saját listához ad
nl_nl: Toevoegen aan kijklijst
sv_se: Lägg till Min lista
zh_cn: 加入观看列表

# #30028
source: Remove from Watchlist
hu_hu: Törlés a saját listából
nl_nl: Verwijderen van kijklijst
sv_se: Ta bort från Min lista
zh_cn: 从观看列表中移除

# #30029
source: Added to Watchlist
hu_hu: Saját listához hozzáadva
nl_nl: Toegevoegd aan kijklijst
sv_se: Tillagd till Min lista
zh_cn: 加入观看列表

# #30030
source: Enter your Profile PIN
hu_hu: Add meg a PIN-kódot
nl_nl: Voer uw profielpincode in
sv_se: Ange din profils PINKOD
zh_cn: 输入您的用户档案PIN码

# #30043
source: You are not entitled to access this content. Check your subscription is valid.
hu_hu: Nem jogosult hozzáférni ehhez a tartalomhoz. Ellenőrizze, hogy az előfizetése érvényes-e.
nl_nl: Je hebt geen recht op toegang tot deze inhoud. Controleer of uw abonnement geldig is.
sv_se: Du har inte rätt att få tillgång till detta innehåll. Kontrollera att din prenumeration är giltig.
zh_cn: 您无权访问此内容。 请检查并重试。

# #30044
source: Your login details are in-correct. Please check them and try again.
hu_hu: A bejelentkezési adatai helytelenek. Kérjük, ellenőrizze őket, és próbálja újra.
nl_nl: Uw inloggegevens zijn onjuist. Controleer ze en probeer het opnieuw.
sv_se: Dina inloggningsuppgifter är felaktiga Kontrollera dem och försök igen.
zh_cn: 您无权访问此内容。 请检查并重试。

# #30045
source: {label} [B](Coming Soon)[/B]
hu_hu: {label} [B](Hamarosan)[/B]
nl_nl: {label} [B](Binnenkort beschikbaar)[/B]
sv_se: {label} [B](Kommer snart)[/B]
zh_cn: {label} [B](即将上线)[/B]

# #30046
source: Incorrect Pin
hu_hu: Hibás PIN
nl_nl: Onjuiste pincode
sv_se: Felaktig PINKOD
zh_cn: PIN码错误

# #30047
source: Disney+ Watchlist
hu_hu: Disney+ Saját lista
nl_nl: Disney+ kijklijst
sv_se: Disney+ Min lista
zh_cn: Disney+ 观看列表

# #30048
source: From {time:0>8}
hu_hu: Innen {time:0>8}
nl_nl: Van {time:0>8}
sv_se: Från {time:0>8}
zh_cn: 从 {time:0>8} 开始

# #30049
source: {label} [B](Available {date})[/B]
hu_hu: {label} [B](Hozzáférhető {date})[/B]
nl_nl: {label} [B](Beschikbaar {date})[/B]
sv_se: {label} [B](Tillgänglig {date})[/B]
zh_cn: {label} [B](上线日期 {date})[/B]

# #30050
source: DD/MM/YYYY
hu_hu: NN/HH/ÉÉÉÉ
sv_se: YYYY-MM-DD
zh_cn: YYYY/MM/DD

# #30051
source: Could not find stream data for this content
hu_hu: Nem található adatfolyam adat ehhez a tartalomhoz
nl_nl: Kan geen streamgegevens voor deze inhoud vinden
sv_se: Det gick inte att hitta strömdata för detta innehåll
zh_cn: 找不到此内容的流媒体数据

# #30052
source: Dolby Atmos
zh_cn: 杜比全景声

# #30053
source: Profile Settings
hu_hu: Profil beállítások
nl_nl: Profielinstelling
sv_se: Profilinställningar
zh_cn: 用户档案设置

# #30054
source: Continue Watching
hu_hu: Lejátszás folytatása
nl_nl: Doorgaan met kijken
sv_se: Fortsätt titta
zh_cn: 继续观看

# #32055
source: Ask
hu_hu: Kérdezz rá
nl_nl: Vragen
sv_se: Fråga
zh_cn: 询问

# #32043
source: Best
hu_hu: Legjobb
nl_nl: Het beste
sv_se: Bäst
zh_cn: 最高画质

# #32060
source: Lowest
hu_hu: alacsonyabb
nl_nl: laagste
sv_se: Lägsta
zh_cn: 最低画质

# #32048
source: Bypass
hu_hu: Kihagyás
sv_se: Gå förbi
zh_cn: 忽略

# #32054
source: Custom
hu_hu: Saját
nl_nl: Aangepast
sv_se: Anpassad
zh_cn: 自定义

# #32073
source: Disabled
hu_hu: Törölve
sv_se: Inaktiverad
zh_cn: 禁用

# #30042
source: Continue Watching
hu_hu: Lejátszás folytatása
nl_nl: Doorgaan met kijken
sv_se: Fortsätt titta

# #30017
source: {name} [PIN]
sv_se: {name} [PINKOD]
