Repository: slynobody/Linux-Mediacenter
Catalog: .kodi/addons/plugin.video.twitch/resources/language/resource.language.*/strings.po
Languages: fi_fi

# Addon Summary
source: Twitch video plugin
fi_fi: Twitch-videolisäosa

# Addon Description
source: Watch your favorite gaming streams!
fi_fi: Katsele suosikkisuoratoistojasi videopeleistä!

# #30001
source: Games
fi_fi: Pelit

# #30002
source: Following
fi_fi: Seurataan

# #30003
source: Search
fi_fi: Haku

# #30004
source: Settings
fi_fi: Asetukset

# #30005
source: Popular Streams
fi_fi: Suositut suoratoistot

# #30006
source: Teams
fi_fi: Tiimit

# #30007
source: Search for channels
fi_fi: Etsi kanavia

# #30008
source: Channels
fi_fi: Kanavat

# #30009
source: Live Channels
fi_fi: Live-kanavat

# #30011
source: next page...
fi_fi: Seuraava sivu...

# #30012
source: -- Currently Live Streams --
fi_fi: -- Käynnissä olevat live-lähetykset --

# #30013
source: -- Followed Channels --
fi_fi: -- Seuratut kanavat --

# #30020
source: Http error
fi_fi: HTTP-virhe

# #30021
source: No Live Data Found
fi_fi: Live-tietoja ei löytynyt

# #30022
source: No archives found for
fi_fi: Arkistoja ei löytynyt

# #30023
source: User Token Error
fi_fi: Käyttäjän Token-virhe

# #30024
source: Changed video settings
fi_fi: Muuttuneet videoasetukset

# #30025
source: Selected video settings are not available
fi_fi: Valitut videoasetukset eivät ole enää käytettävissä

# #30026
source: TwitchApi error
fi_fi: Twitch API -virhe

# #30027
source: JSON error
fi_fi: JSON-virhe

# #30028
source: Failed to parse the result set
fi_fi: Tulosjoukon jäsennys epäonnistui

# #30029
source: Please check your internet connection
fi_fi: Tarkista Internet-yhteytesi

# #30040
source: Video Quality
fi_fi: Videon laatu

# #30045
source: Display titles
fi_fi: Näytä nimet

# #30046
source: Streamer - Stream Title
fi_fi: Suoratoistaja - Suoratoiston nimi

# #30047
source: Viewers - Streamer - Stream Title
fi_fi: Katsojia - Suoratoistaja - Suoratoiston nimi

# #30048
source: Stream Title
fi_fi: Suoratoiston nimi

# #30049
source: Streamer
fi_fi: Suoratoistaja

# #30050
source: Username
fi_fi: Käyttäjätunnus

# #30051
source: Streamer - Game Title - Stream Title
fi_fi: Suoratoistaja - Pelin nimi - Suoratoiston nimi

# #30052
source: Enable
fi_fi: Käytä

# #30053
source: Password (OAuth Token)
fi_fi: Salasana (OAuth Token)

# #30054
source: Language | Streamer - Stream Title
fi_fi: Kieli | Suoratoistaja - Mediavirran nimi

# #30060
source: Unnamed Streamer
fi_fi: Nimetön suoratoistaja

# #30061
source: Untitled Stream
fi_fi: Nimetön suoratoisto

# #30062
source: Unknown Number of Viewers
fi_fi: Tuntematon katsojamäärä

# #30063
source: Unknown Language
fi_fi: Tuntematon kieli

# #30064
source: Unknown Game
fi_fi: Tuntematon peli

# #30065
source: Truncate displayed titles
fi_fi: Lyhennä näytetyt nimet

# #30066
source: Followed Games
fi_fi: Seuratut pelit

# #30067
source: Game Title Viewers | Streamer - Stream Title
fi_fi: Pelin katsojat | Suoratoistaja - Suoratoiston nimi

# #30068
source: Content Type
fi_fi: Sisältötyyppi

# #30069
source: Files
fi_fi: Tiedostot

# #30070
source: TV Shows
fi_fi: Sarjat

# #30071
source: Movies
fi_fi: Elokuvat

# #30072
source: Episodes
fi_fi: Jaksot

# #30073
source: Music Videos
fi_fi: Musiikkivideot

# #30074
source: Automatically refresh live preview cache
fi_fi: Päivitä live-esikatselun välimuisti automaattisesti

# #30075
source: Install IrcChat (script.ircchat)
fi_fi: Asenna IcrChat-lisäosa (script.ircchat)

# #30076
source: General
fi_fi: Yleiset

# #30077
source: Play (Choose Quality)
fi_fi: Toista (valitse laatu)

# #30078
source: Past Broadcasts
fi_fi: Menneet lähetykset

# #30079
source: Video Highlights
fi_fi: Videon korostukset

# #30080
source: Could not find any playable urls
fi_fi: Toistettavia URL-osoitteita ei löytynyt

# #30082
source: Live Previews
fi_fi: Live-esikatselut

# #30083
source: Live Preview Settings
fi_fi: Live-esikatselun asetukset

# #30084
source: Clear live preview cache
fi_fi: Tyhjennä live-esikatselun välimuisti

# #30085
source: ***** WARNING *****
fi_fi: ***** VAROITUS *****

# #30086
source: These settings may allow this add-on to delete database entries and images[CR]for cached live previews.
fi_fi: Nämä asetukset saattavat mahdollistaa tälle lisäosalle puskuroitujen live-esikatseluiden tietokantamerkintöjen ja kuvien poiston.

# #30087
source: Notifications
fi_fi: Ilmoitukset

# #30088
source: Game
fi_fi: Peli

# #30089
source: Viewers
fi_fi: Katsojia

# #30090
source: Language
fi_fi: Kieli

# #30091
source: Mature
fi_fi: Aikuisille

# #30092
source: Partner
fi_fi: Kumppani

# #30093
source: Delay
fi_fi: Viive

# #30094
source: Automatic refresh interval (minutes)
fi_fi: Automaattipäivityksen tiheys (minuuttia)

# #30095
source: Username is required
fi_fi: Käyttäjätunnus on pakollinen

# #30098
source: Select Video by ID or URL
fi_fi: Valitse video ID:n tai URL-osoitteen perusteella

# #30100
source: Visit www.twitch.tv/settings/connections and [CR]'Register your application' for an OAuth Client-ID
fi_fi: Avaa https://dev.twitch.tv/console/apps ja paina "Register Your Application" saadaksesi OAuth Client ID:n

# #30101
source: Visit www.twitchapps.com/tmi to generate an OAuth token
fi_fi: Luo OAuth Token osoitteessa www.twitchapps.com/tmi

# #30102
source: Source
fi_fi: Lähde

# #30112
source: Quality may result in best match
fi_fi: Laatu voi johtaa parhaaseen tulokseen

# #30113
source: Uploads
fi_fi: Tallennukset

# #30114
source: Confirm
fi_fi: Vahvista

# #30115
source: Function cache has been reset
fi_fi: Toimintovälimuisti tyhjennettiin

# #30116
source: Function cache reset failed
fi_fi: Toimintovälimuistin tyhjennys epäonnistui

# #30117
source: Reset function cache?
fi_fi: Tyhjennetäänkö toimintovälimuisti?

# #30118
source: Developer
fi_fi: Kehittäjä

# #30120
source: Cache
fi_fi: Välimuisti

# #30121
source: Cache expire time (minutes)
fi_fi: Välimuistin erääntymisaika (minuuttia)

# #30122
source: Reset function cache
fi_fi: Tyhjennä toimintovälimuisti

# #30123
source: Items per page
fi_fi: Kohteita sivulla

# #30124
source: Video Id/Url
fi_fi: Videon ID/URL

# #30125
source: Streams
fi_fi: Suoratoistot

# #30126
source: Refresh
fi_fi: Päivitä

# #30127
source: Login
fi_fi: Kirjaudu sisään

# #30128
source: OAuth token is required
fi_fi: OAuth Token on pakollinen

# #30129
source: Error
fi_fi: Virhe

# #30130
source: Go to %s
fi_fi: Avaa "%s"

# #30131
source: No results returned
fi_fi: Ei tuloksia

# #30132
source: OAuth token is required for access
fi_fi: OAuth Token tarvitaan käyttöön

# #30133
source: Authorize
fi_fi: Todenna

# #30134
source: Get your OAuth token by logging in/signing up to Twitch.tv here:
fi_fi: Hanki OAuth Token kirjautumalla/rekisteröitymällä Twitch.tv-palveluun täällä:

# #30135
source: Get OAuth token
fi_fi: Hanki OAuth Token

# #30136
source: Always ask
fi_fi: Kysy aina

# #30138
source: *** Do NOT share your OAuth token. ***
fi_fi: *** ÄLÄ jaa OAuth Tokeniasi. ***

# #30139
source: Toggle follow
fi_fi: Kytke seuraaminen

# #30140
source: Now following %s
fi_fi: Seurataan käyttäjää %s

# #30141
source: Unfollowed %s
fi_fi: Lopetettiin käyttäjän %s seuraaminen

# #30142
source: Redirect URI
fi_fi: Uudelleenohjauksen URI

# #30143
source: Would you like to follow %s?
fi_fi: Haluatko seurata käyttäjää %s?

# #30144
source: Are you sure you want to unfollow %s?
fi_fi: Haluatko varmasti lopettaa käyttäjän %s seuraamisen?

# #30145
source: Toggle block user
fi_fi: Kytke käyttäjän esto

# #30146
source: Blocked %s
fi_fi: Estettiin käyttäjä %s

# #30147
source: Unblocked %s
fi_fi: Sallittiin käyttäjä %s

# #30148
source: Would you like to block %s?
fi_fi: Haluatko estää käyttäjän %s?

# #30149
source: Are you sure you want to unblock %s?
fi_fi: Haluatko sallia käyttäjän %s?

# #30150
source: Blacklist %s
fi_fi: Lisää %s estolistalle

# #30151
source: Blacklisted %s
fi_fi: %s lisättiin estolistalle

# #30152
source: Lists
fi_fi: Listat

# #30153
source: Blacklist
fi_fi: Estolista

# #30154
source: Remove a user
fi_fi: Poista käyttäjä

# #30155
source: Remove a game
fi_fi: Poista peli

# #30156
source: Remove all users
fi_fi: Poista kaikki käyttäjät

# #30157
source: Remove all games
fi_fi: Poista kaikki pelit

# #30158
source: Remove %s from blacklist
fi_fi: Poista %s estolistalta

# #30159
source: Removed %s from blacklist
fi_fi: Poistettiin %s estolistalta

# #30160
source: Cleared %s %s
fi_fi: Tyhjennettiin %s %s

# #30161
source: Are you sure you want to clear %s %s?
fi_fi: Haluatko varmasti tyhjentää %s %s?

# #30162
source: Clear list
fi_fi: Tyhjennä lista

# #30163
source: Set default quality
fi_fi: Aseta oletuslaatu

# #30164
source: Default '%s' quality '%s' set for %s
fi_fi: Oletusarvoinen '%s' laatu '%s' asetettiin kohteelle %s

# #30165
source: Removed default '%s' quality for %s
fi_fi: Poistettiin oletusarvoinen '%s' laatu kohteelta %s

# #30166
source: Remove %s quality
fi_fi: Poista %s laatu

# #30167
source: Default Qualities
fi_fi: Oletuslaadut

# #30168
source: Clear default quality
fi_fi: Tyhjennä oletuslaatu

# #30169
source: Choose Quality
fi_fi: Valitse laatu

# #30170
source: Playlists
fi_fi: Toistolistat

# #30171
source: Collections
fi_fi: Kokoelmat

# #30172
source: Browse
fi_fi: Selaa

# #30175
source: Videos
fi_fi: Videot

# #30176
source: Clips
fi_fi: Leikkeet

# #30177
source: Invalid OAuth token
fi_fi: Virheellinen OAuth Token

# #30178
source: Missing required scopes: %s
fi_fi: Vaadittuja laajuuksia puuttuu: %s

# #30179
source: Client id mismatch
fi_fi: Client ID ei täsmää

# #30180
source: Go to '%s' - '%s' - '%s' to generate a new token
fi_fi: Avaa "%s" - "%s" - "%s" luodaksesi uuden Tokenin

# #30181
source: Are you sure you want to blacklist %s?
fi_fi: Haluatko varmasti lisätä kohteen %s estolistalle?

# #30184
source: Change sort by
fi_fi: Vaihda lajitteluperustetta

# #30185
source: Change sort direction
fi_fi: Vaihda lajittelusuuntaa

# #30186
source: Change period
fi_fi: Vaihda ajanjaksoa

# #30187
source: Popular
fi_fi: Suosittua

# #30188
source: Views
fi_fi: Katsottu

# #30189
source: Add a language
fi_fi: Lisää kieli

# #30190
source: Remove a language
fi_fi: Poista kieli

# #30191
source: Remove a stream quality
fi_fi: Poista suoratoistolaatu

# #30192
source: Remove a video quality
fi_fi: Poista videolaatu

# #30193
source: Remove a clip quality
fi_fi: Poista leikelaatu

# #30194
source: Remove all stream qualities
fi_fi: Poista kaikki suoratoistolaadut

# #30195
source: Remove all video qualities
fi_fi: Poista kaikki videolaadut

# #30196
source: Remove all clip qualities
fi_fi: Poista kaikki leikelaadut

# #30197
source: Requires confirmation
fi_fi: Vaatii vahvistuksen

# #30198
source: Requires subscription to %s
fi_fi: Vaatii kohteen %s tilauksen

# #30199
source: Connection failed
fi_fi: Yhteys epäonnistui

# #30200
source: No %s found
fi_fi: Kohdetta %s ei löytynyt

# #30201
source: Bandwidth
fi_fi: Kaistanleveys

# #30202
source: Currently Live
fi_fi: Live-lähetys on käynnissä

# #30203
source: Went Live
fi_fi: Aloitti live-lähetyksen

# #30204
source: Live notifications
fi_fi: Live-ilmoitukset

# #30205
source: Audible
fi_fi: Kuuluva

# #30206
source: Playback failed
fi_fi: Toisto epäonnistui

# #30207
source: Retrying in %d seconds
fi_fi: Yritetään uudelleen %d sekunnin kuluttua

# #30208
source: Attempting to reconnect to %s
fi_fi: Yritetään yhdistää kohteeseen %s uudelleen

# #30209
source: Attempt #%d
fi_fi: Yritys #%d

# #30210
source: Attempt reconnection to live streams
fi_fi: Yritä yhdistää live-suoratoistoihin uudelleen

# #30211
source: Enabled
fi_fi: Käytössä

# #30212
source: Failed to connect to Twitch API
fi_fi: Twitch API -yhteys epäonnistui

# #30213
source: Followers
fi_fi: Seuraajia

# #30214
source: Items
fi_fi: Kohteita

# #30215
source: Duration
fi_fi: Kesto

# #30216
source: Curated
fi_fi: Valikoidut

# #30217
source: Press OK to resolve
fi_fi: Ratkaise painamalla OK

# #30218
source: Supported video ids: a123435, c123435, v123435, videos123435[CR]Example urls:[CR]https://twitch.tv/gamesdonequick...[CR].../v/113336135[CR].../v/113336135?t=1h52m35s
fi_fi: Tuetut video-ID:t: a123435, c123435, v123435, videos123435[CR]URL-esimerkkejä:[CR]https://twitch.tv/gamesdonequick...[CR].../v/113336135[CR].../v/113336135?t=1h52m35s

# #30219
source: Main Menu
fi_fi: Päävalikko

# #30220
source: Failed to get url, try again shortly.
fi_fi: URL-osoitteen nouto epäonnistui, yritä hetken kuluttua uudelleen.

# #30221
source: Unknown
fi_fi: Tuntematon

# #30222
source: VODCast highlight color
fi_fi: VODCast-korostusväri

# #30223
source: Use inputstream.adaptive
fi_fi: Käytä InputStream Adaptive -lisäosaa

# #30224
source: Configure inputstream.adaptive
fi_fi: Määritä InputStream Adaptive -lisäosan asetukset

# #30225
source: inputstream.adaptive is enabled in the Twitch settings, however inputstream.adaptive appears to be disabled. Would you like to enable inputstream.adaptive now?
fi_fi: InputStream Adaptive -lisäosan käyttö Twitch-lisäosan kanssa on otettu käyttöön, mutta InputStream Adaptive ei näytä olevan käytössä. Haluatko ottaa sen käyttöön?

# #30226
source: The installed inputstream.adaptive add-on does not meet the version requirement(%s), and has been disabled in the Twitch add-on settings.
fi_fi: InputStream Adaptive -lisäosan asennettu versio (%s) ei vastaa vaadittua versiota, joten sen käyttö Twitch-lisäosan kanssa on poistettu käytöstä.

# #30227
source: Revoke Token
fi_fi: Peru Token

# #30228
source: Are you sure you want to revoke your OAuth token?
fi_fi: Haluatko varmasti perua OAuth Tokenisi?

# #30229
source: OAuth token has been revoked
fi_fi: OAuth Token peruttiin

# #30230
source: OAuth token has been updated
fi_fi: OAuth Token päivitettiin

# #30231
source: %s started streaming %s
fi_fi: %s aloitti suoratoiston %s

# #30232
source: Notify at start
fi_fi: Ilmoita aloitettassa

# #30233
source: Group notifications at start
fi_fi: Ryhmittele aloitusilmoitukset

# #30234
source: Reset cache on Refresh
fi_fi: Tyhjennä välimuisti päivitettäessä

# #30235
source: New search
fi_fi: Uusi haku

# #30236
source: Search history size
fi_fi: Hakuhistorian koko

# #30237
source: Clear search history?
fi_fi: Tyhjennetäänkö hakuhistoria?

# #30238
source: Remove %s from search history?
fi_fi: Poistetaanko %s hakuhistoriasta?

# #30239
source: Remove %s
fi_fi: Poista %s

# #30240
source: Clear search history
fi_fi: Tyhjennä hakuhistoria

# #30241
source: Search history cleared
fi_fi: Hakuhistoria tyhjennettiin

# #30242
source: Removed %s from search history
fi_fi: Poistettiin %s hakuhistoriasta

# #30243
source: Maintenance
fi_fi: Ylläpito

# #30244
source: Search History
fi_fi: Hakuhistoria

# #30245
source: Delete streams search history
fi_fi: Poista suoratoistojen hakuhistoria

# #30246
source: Delete channels search history
fi_fi: Poista kanavien hakuhistoria

# #30247
source: Delete games search history
fi_fi: Poista pelien hakuhistoria

# #30248
source: Delete video id/url search history
fi_fi: Poista videoiden ID-/URL-hakuhistoria

# #30249
source: Other
fi_fi: Muut

# #30250
source: Delete storage.json
fi_fi: Poista "storage.json" -tiedosto

# #30251
source: Are you sure you want to delete %s?
fi_fi: Haluatko varmasti poistaa kohteen %s?

# #30252
source: Deleting %s succeeded
fi_fi: Kohteen %s poisto onnistui

# #30253
source: Deleting %s failed
fi_fi: Kohteen %s poisto epäonnistui

# #30254
source: Adaptive
fi_fi: Mukautuva

# #30255
source: Thumbnail size
fi_fi: Pienoiskuvien koko

# #30256
source: Large
fi_fi: Suuri

# #30257
source: Medium
fi_fi: Keskikokoinen

# #30258
source: Small
fi_fi: Pieni

# #30259
source: Live preview refresh interval (minutes)
fi_fi: Live-esikatselun päivitystiheys (minuuttia)

# #30260
source: Limit to 30 fps
fi_fi: Rajoita 30 kuvaan sekunnissa (fps)

# #30261
source: Private API Credentials
fi_fi: Yksityiset API-käyttöoikeustiedot

# #30262
source: Change languages
fi_fi: Vaihda kieltä

# #30263
source: Frame rate limit
fi_fi: Kuvanopeusrajoitus

# #30264
source: Follow
fi_fi: Seuraa

# #30265
source: Unfollow
fi_fi: Lopeta seuraaminen

# #30266
source: Add to queue
fi_fi: Lisää toistojonoon

# #30267
source: An OAuth token is required for access, go to '%s' - '%s' - '%s' to generate one
fi_fi: OAuth Token tarvitaan käyttöä varten. Avaa "%s" - "%s" - "%s" luodaksesi sellaisen.

# #30268
source: Private OAuth authentication error
fi_fi: Yksityisen OAuth-todennuksen virhe

# #30269
source: Private OAuth credentials are incorrect, go to '%s' - '%s' - '%s' to correct the issue
fi_fi: Yksityisen OAuth-todennuksen käyttöoikeustiedot ovat virheelliset. Avaa "%s" - "%s" - "%s" korjataksesi ongelman.

# #30270
source: Subscriber and Turbo Benefits
fi_fi: Tilaaja- ja Turbo-edut

# #30271
source: For information on how to obtain this token, visit
fi_fi: Lisätietoja tällaisen Tokenin hankinnasta saat osoitteesta

# #30273
source: OAuth Token is expired or invalid
fi_fi: OAuth Token on erääntynyt tai virheellinen
